app/controllers/houses_controller.rb

SELECT "students".* FROM "students" WHERE "students"."house_id" = $1  [["house_id", 1]]
---
  def show
    @house = House.find( params[:id] )
    @students = @house.students.all