app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def index
    @houses = House.all
    @students = Student.all

INSERT INTO "students" ("created_at", "img_url", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 14 Apr 2015 21:55:02 UTC +00:00], ["img_url", ""], ["name", ""], ["updated_at", Tue, 14 Apr 2015 21:55:02 UTC +00:00]]
---
  def create
  @house = House.all.sample.id
  @student = Student.new( student_params )
  @student.house_id = @house
  if @student.save